# Задача 18: Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X.
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

# arrayA = []
# n = int(input('Введите длину массива: '))

# for i in range(1, n+1):
#     arrayA.append(i)
# print(arrayA)

# x = float(input('Введите искомое число: '))


# min = n
# for i in range(len(arrayA)):
#     temp = arrayA[i] - x
#     if temp < min:
#         min = abs(temp)
#         result = arrayA[i]

# print('ближайшее - ', result)
